In [21]:
%load_ext sql
%sql mysql+mysqlconnector://root:viswaa@localhost/practice

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [22]:
%%sql
use practice;

 * mysql+mysqlconnector://root:***@localhost/practice
   mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [26]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost/practice
   mysql+mysqlconnector://root:***@localhost/test
9 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('practice',),
 ('sakila',),
 ('sql_practice',),
 ('sys',),
 ('test',),
 ('world',)]

In [28]:
%%sql
CREATE TABLE employees(
    employee_id INT PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    hire_date DATE NOT NULL,
    salary DECIMAL(10,2)
);

 * mysql+mysqlconnector://root:***@localhost/practice
   mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [33]:
%%sql
show tables;

 * mysql+mysqlconnector://root:***@localhost/practice
   mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[('employees',)]

In [32]:
%%sql
INSERT INTO employees (employee_id , first_name , last_name , hire_date , salary ) values (101 , 'Viswaa' , 'E' , '2025-11-30' , 25000);

 * mysql+mysqlconnector://root:***@localhost/practice
   mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [36]:
%%sql
select * from employees

 * mysql+mysqlconnector://root:***@localhost/practice
   mysql+mysqlconnector://root:***@localhost/test
4 rows affected.

[(101, 'Viswaa', 'E', datetime.date(2025, 11, 30), Decimal('25000.00')),
 (102, 'Sathish', 'S', datetime.date(2025, 9, 7), Decimal('30000.00')),
 (103, 'Gughashree', 'M', datetime.date(2025, 9, 16), Decimal('61000.00')),
 (104, 'kowsalya', 'S', datetime.date(2025, 5, 15), Decimal('60000.00'))]

In [35]:
%%sql
INSERT INTO employees (employee_id , first_name , last_name , hire_date , salary ) values (102 , 'Sathish' , 'S' , '2025-09-07' , 30000);
INSERT INTO employees (employee_id , first_name , last_name , hire_date , salary ) values (103 , 'Gughashree' , 'M' , '2025-09-16' , 61000);
INSERT INTO employees (employee_id , first_name , last_name , hire_date , salary ) values (104 , 'kowsalya' , 'S' , '2025-05-15' , 60000);

 * mysql+mysqlconnector://root:***@localhost/practice
   mysql+mysqlconnector://root:***@localhost/test
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [38]:
%%sql
CREATE TABLE highly_paid_employees as
SELECT 
    employee_id,
    first_name,
    last_name,
    salary
FROM employees
WHERE salary > 60000;

 * mysql+mysqlconnector://root:***@localhost/practice
   mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [39]:
%%sql
select * from highly_paid_employees;

 * mysql+mysqlconnector://root:***@localhost/practice
   mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(103, 'Gughashree', 'M', Decimal('61000.00'))]